tutorials/myLusgsFoam/transonicChannel.realGas/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.8e7;

boundaryField
{
    emptyPlanes
    {
        type            empty;
    }
    "(.*Wall)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type isentropicInletPressure;
        p0              uniform 1e7;
        value           uniform 0.8e7;
    }

    outlet
    {
        type fixedValue;
        value		uniform 7.37e6;
    }
}

// ************************************************************************* //
